/**
 * for( 시작; 조건; 종료식){
 *  실행문;
 * }
 */
// 반복해서 'hello' 문자열을 10번 출력
// for( let i=10 ; i>=0 ; i-- ){
//     // ( 1 )hello
//     console.log( '( ' + i + ' )' + 'hello' );
// }

/***
 * 구구단 3단
 */
// for( let i=1 ; i<=9 ; i++ ){
//     // console.log( '3 * ' + i + '=' + (3*i) );
//     // 3 * 1 = 3
//     //${명령문}
//     console.log(`3 * ${i} = ${3*i}` );
// }

/***
 * 1부터 100까지의 합을 계산하여 출력하라
 */
let sum = 0;
for( let i=0 ; i<=100 ; i+=2 ){
    sum += i;
}
console.log( `1부터 100까지의 합 = ${sum}`);